echo "Ваша программа называется: $0"
echo "Ваш первый параметр: $1"
echo "Ваш второй параметр: $2"

my_var="первый: $1 второй: $2"
echo "Значение my_var = ${my_var}"

new_folder_name="$HOME/projects/project02/project_$1"

mkdir $new_folder_name
text="
 ______   ______     ______       __     ______     ______     ______  
/\  == \ /\  == \   /\  __ \     /\ \   /\  ___\   /\  ___\   /\__  _\ 
\ \  _-/ \ \  __<   \ \ \/\ \   _\_\ \  \ \  __\   \ \ \____  \/_/\ \/ 
 \ \_\    \ \_\ \_\  \ \_____\ /\_____\  \ \_____\  \ \_____\    \ \_\ 
  \/_/     \/_/ /_/   \/_____/ \/_____/   \/_____/   \/_____/     \/_/ 
                                                                       
# Название проект $1 
### Попытка номер 2 создать файл 
__*и скомментировать его в гит*__
$2"
echo  "$text" > "${new_folder_name}/README.md"

cd
cd ~/projects/project02/project_$1
git init
git add README.md
git commit -a -m "Новый коммит"
exit 0
